// provinces.ts
export const provinces = [
  {
    value: "آذربایجان شرقی",
    label: "آذربایجان شرقی",
    cities: ["تبریز", "مرند", "صوفیان", "کلیبر"],
  },
  {
    value: "آذربایجان غربی",
    label: "آذربایجان غربی",
    cities: ["ارومیه", "خوی", "مهاباد", "سلماس"],
  },
  {
    value: "اصفهان",
    label: "اصفهان",
    cities: ["اصفهان", "کاشان", "نجف آباد", "خمینی شهر"],
  },
  {
    value: "البرز",
    label: "البرز",
    cities: ["کرج", "ساوجبلاغ", "نظرآباد", "شهرجدید هشتگرد"],
  },
  {
    value: "ایلام",
    label: "ایلام",
    cities: ["ایلام", "دره‌شهر", "مهران", "دهلران"],
  },
  { value: "بوشهر", label: "بوشهر", cities: ["بوشهر", "دشتی", "گناوه", "دیر"] },
  {
    value: "تهران",
    label: "تهران",
    cities: ["تهران", "شهریار", "ورامین", "فیروزکوه"],
  },
  {
    value: "چهارمحال و بختیاری",
    label: "چهارمحال و بختیاری",
    cities: ["شهرکرد", "فارسان", "کاشان", "لردگان"],
  },
  {
    value: "خراسان جنوبی",
    label: "خراسان جنوبی",
    cities: ["بیرجند", "قائنات", "نهبندان", "سرایان"],
  },
  {
    value: "خراسان رضوی",
    label: "خراسان رضوی",
    cities: ["مشهد", "سبزوار", "تربت حیدریه", "نیشابور"],
  },
  {
    value: "خراسان شمالی",
    label: "خراسان شمالی",
    cities: ["بجنورد", "شیروان", "آشخانه", "فاروج"],
  },
  {
    value: "خوزستان",
    label: "خوزستان",
    cities: ["اهواز", "دزفول", "آبادان", "خرمشهر"],
  },
  {
    value: "زنجان",
    label: "زنجان",
    cities: ["زنجان", "خدابنده", "ابهر", "سلطانیه"],
  },
  {
    value: "سمنان",
    label: "سمنان",
    cities: ["سمنان", "شاهرود", "گرمسار", "مهدی‌شهر"],
  },
  {
    value: "سیستان و بلوچستان",
    label: "سیستان و بلوچستان",
    cities: ["زاهدان", "چابهار", "ایرانشهر", "خاش"],
  },
  { value: "فارس", label: "فارس", cities: ["شیراز", "مرودشت", "فسا", "جهرم"] },
  {
    value: "قزوین",
    label: "قزوین",
    cities: ["قزوین", "البرز", "تاکستان", "آبیک"],
  },
  { value: "قم", label: "قم", cities: ["قم"] },
  {
    value: "کردستان",
    label: "کردستان",
    cities: ["سنندج", "مریوان", "قروه", "بیجار"],
  },
  {
    value: "کرمان",
    label: "کرمان",
    cities: ["کرمان", "رفسنجان", "بردسیر", "سیرجان"],
  },
  {
    value: "کرمانشاه",
    label: "کرمانشاه",
    cities: ["کرمانشاه", "اسلام آباد غرب", "صحنه", "کنگاور"],
  },
  {
    value: "کهگیلویه و بویراحمد",
    label: "کهگیلویه و بویراحمد",
    cities: ["یاسوج", "گچساران", "دوگنبدان", "چرام"],
  },
  {
    value: "گلستان",
    label: "گلستان",
    cities: ["گرگان", "علی آباد کتول", "کردکوی", "آق قلا"],
  },
  {
    value: "گیلان",
    label: "گیلان",
    cities: ["رشت", "انزلی", "صومعه سرا", "لنگرود"],
  },
  {
    value: "لرستان",
    label: "لرستان",
    cities: ["خرم‌آباد", "بروجرد", "دورود", "الیگودرز"],
  },
  {
    value: "مازندران",
    label: "مازندران",
    cities: ["ساری", "آمل", "بابل", "نوشهر"],
  },
  {
    value: "مركزی",
    label: "مرکزی",
    cities: ["اراک", "ساوه", "خمین", "دلیجان"],
  },
  {
    value: "هرمزگان",
    label: "هرمزگان",
    cities: ["بندرعباس", "قشم", "رودان", "میناب"],
  },
  {
    value: "همدان",
    label: "همدان",
    cities: ["همدان", "تویسرکان", "ملایر", "نهاوند"],
  },
  { value: "یزد", label: "یزد", cities: ["یزد", "اشکذر", "میبد", "تفت"] },
];

export type ProvinceType = (typeof provinces)[number];
